TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ЛогСобытийВебСервисов/гкс_ЛогСобытийВебСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ЛогСобытийВебСервисов</name>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеОтвета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗаголовковЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗаголовковОтвета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>УниверсальнаяДата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.гкс_РесурсыВебСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТехнологииОбменаДанными/гкс_ТехнологииОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТехнологииОбменаДанными</name>
  <enumValues>
    <name>REST</name>
  </enumValues>
  <enumValues>
    <name>SOAP</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_РесурсыВебСервисов/гкс_РесурсыВебСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_РесурсыВебСервисов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Warehouse_API</name>
      <description>Warehouse API</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ДанныеMFM</name>
      <description>Данные MFM</description>
    </items>
  </predefined>
  <attributes>
    <name>Подключение</name>
    <type>
      <types>CatalogRef.гкс_ПодключениеКВебСервисам</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокументацию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>EnumRef.гкс_ТипПараметраЗапроса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПодключениеКВебСервисам/гкс_ПодключениеКВебСервисам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПодключениеКВебСервисам</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПодключениеWarehouse</name>
      <description>Подключение Warehouse</description>
    </items>
    <items>
      <name>ПодключениеСРПВ</name>
      <description>Подключение СРПВ</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАутентификациюОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологияОбмена</name>
    <type>
      <types>EnumRef.гкс_ТехнологииОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_РаботаСВебСервисами/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполнить запрос.
// 
// Параметры:
//  Сервис - СправочникСсылка.гкс_РесурсыВебСервисов - 
//  ПараметрыВыполненияЗапроса - Неопределено, Структура - 
// 
// Возвращаемое значение:
//  Структура - Выполнить запрос:
// * Метод - Строка -
// * URL - Строка -
// * КодСостояния - Число -
// * Заголовки - Соответствие -
// * Тело - ДвоичныеДанные -
// * Кодировка - Строка -
// * ВремяВыполнения - Неопределено -
// * ЭтоПостоянныйРедирект - Булево -
// * ЭтоРедирект - Булево -
// * Cookies - Соответствие -
// * Ошибки - Массив -
//
Функция ВыполнитьЗапрос(Сервис, ПараметрыВыполненияЗапроса = Неопределено) Экспорт
	
	Запросник = Обработки.гкс_ЗапросникКВебСервисам.Создать();
	Возврат  Запросник
	           .Инициализировать(Сервис, ПараметрыВыполненияЗапроса)
	           .ВыполнитьЗапрос()
	           .РезультатЗапроса();
	
КонецФункции
		   
// Формирование параметров коннектора http для сервиса
// 
// Параметры:
//  РесурсСервиса - СправочникСсылка.гкс_РесурсыВебСервисов - ссылка на ресурс
//
// Возвращаемое значение:
//  Структура - позволяет задать дополнительные параметры:
//    * Заголовки - Соответствие - см. описание Сессия.Заголовки.
//    * Аутентификация - Структура - см. описание Сессия.Аутентификация
//    * Прокси - ИнтернетПрокси - см. описание Сессия.Прокси.
//    * ПараметрыЗапроса - Структура, Соответствие - см. описание Сессия.ПараметрыЗапроса.
//    * ПроверятьSSL - Булево - см. описание Сессия.ПроверятьSSL.
//    * КлиентскийСертификатSSL - СертификатКлиентаФайл, СертификатКлиентаWindows - Значение по умолчанию: Неопределено.
//    * Cookies - Массив - см. описание Сессия.Cookies.
//    * Таймаут - Число - время ожидания осуществляемого соединения и операций, в секундах.
//        Значение по умолчанию - 30 сек.
//    * РазрешитьПеренаправление - Булево - Истина - редиректы будут автоматически разрешены.
//                                          Ложь - будет выполнен только один запрос к серверу.
//    * Json - Структура, Соответствие - данные, которые необходимо сериализовать в JSON.
//    * ПараметрыПреобразованияJSON - Структура - задает параметры преобразования JSON:
//        ** ПрочитатьВСоответствие - Булево - Если Истина, чтение объекта JSON будет выполнено в Соответствие.
//             Если Ложь, объекты будут считываться в объект типа Структура.
//        ** ФорматДатыJSON - ФорматДатыJSON - формат, в котором представлена дата в строке,
//             подлежащей преобразованию.
//        ** ИменаСвойствСоЗначениямиДата -  Строка, Массив Из Строка - имена свойств JSON,
//             для которых нужно вызывать восстановление даты из строки.
//        ** ИмяФункцииВосстановления - Строка - определяет имя функции, которая будет вызывается при чтении
//            каждого свойства и должна иметь следующие параметры:
//               ** Свойство - Строка - указывается только при чтении объектов JSON
//               ** Значение - Произвольный - значение допустимого для сериализации типа
//               ** ДополнительныеПараметры - Произвольный
//            Возвращаемое значение:
//               Произвольный - значение, десериализованное из JSON. 
//        ** МодульФункцииВосстановления - Произвольный - определяет модуль, процедура которого будет использована для
//            восстановления значения.
//        ** ДополнительныеПараметрыФункцииВосстановления - Произвольный - определяет дополнительные параметры, которые
//            будут переданы в функцию восстановления значений.
//        ** ИменаСвойствДляОбработкиВосстановления - Массив - определяет массив имен свойств JSON, для которых
//            будет вызвана функция восстановления.
//        ** МаксимальнаяВложенность - Число - определяет максимальный уровень вложенности объекта JSON.
//    * ПараметрыЗаписиJSON - ПараметрыЗаписиJSON - используемые при записи объекта JSON.
//    * Данные - Строка, ДвоичныеДанные - произвольные данные, которые необходимо отправить в запросе. 
//             - Структура, Соответствие - поля формы, которые необходимо отправить в запрос:
//                 ** Ключ - Строка - имя поля.
//                 ** Значение - Строка - значение поля.
//    * Файлы - См. НовыйОтправляемыйФайл, Массив Из См. НовыйОтправляемыйФайл - файлы, к отправке
//    * МаксимальноеКоличествоПовторов - Число - количество повторных попыток соединения/отправки запроса.
//        Между попытками выполняется задержка, растущая по экспоненте.
//        Но если код состояния один из 413, 429, 503
//        и в ответе есть заголовок Retry-After,
//        то время задержки формируется из значения этого заголовка
//        Значение по умолчанию: 0 - повторы не выполняются.
//    * МаксимальноеВремяПовторов - Число - максимальное общее время (в секундах) отправки запроса с учетом повторов.
//        Значение по умолчанию: 600.
//    * КоэффициентЭкспоненциальнойЗадержки - Число - коэффициент изменения экспоненциальной задержки.
//        1 формирует последовательность задержек: 1, 2, 4, 8 и т.д.
//        2 формируется последовательность задержек: 2, 4, 8, 16 и т.д.
//        ...
//        Значение по умолчанию: 1.
//    * ПовторятьДляКодовСостояний - Неопределено - повторы будут выполняться для кодов состояний >= 500.
//                                 - Массив - повторы будут выполняться для конкретных кодов состояний.
//        Значение по умолчанию: Неопределено.
//
Функция ПараметрыКоннектораHTTP(РесурсСервиса) Экспорт
	
	НастройкиКоннектора = КоннекторHTTP.НовыеПараметры();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключениеКВебСервисам.Таймаут КАК Таймаут,
		|	ПодключениеКВебСервисам.ИспользоватьЗащищенноеСоединение КАК ПроверятьSSL,
		|	ПодключениеКВебСервисам.ИспользоватьАутентификациюОС КАК ИспользоватьАутентификациюОС,
		|	ПодключениеКВебСервисам.URIПространстваИмен КАК URIПространстваИмен,
		|	РесурсыВебСервисов.Метод КАК Метод,
		|	РесурсыВебСервисов.Логировать КАК Логировать,
		|	ПодключениеКВебСервисам.Ссылка КАК Подключение,
		|	ПодключениеКВебСервисам.ИспользоватьПрокси КАК ИспользоватьПрокси,
		|	ПодключениеКВебСервисам.ПроксиСервер КАК ПроксиСервер,
		|	ПодключениеКВебСервисам.ПроксиПорт КАК ПроксиПорт
		|ИЗ
		|	Справочник.гкс_РесурсыВебСервисов КАК РесурсыВебСервисов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПодключениеКВебСервисам КАК ПодключениеКВебСервисам
		|		ПО РесурсыВебСервисов.Подключение = ПодключениеКВебСервисам.Ссылка
		|			И ПодключениеКВебСервисам.ТехнологияОбмена = ЗНАЧЕНИЕ(Перечисление.гкс_ТехнологииОбменаДанными.REST)
		|ГДЕ
		|	РесурсыВебСервисов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РесурсСервиса);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СписокСвойств = "ПроверятьSSL, Таймаут";
		ЗаполнитьЗначенияСвойств(НастройкиКоннектора, Выборка, СписокСвойств); 
			
		Если Выборка.ИспользоватьАутентификациюОС Тогда
			НастройкиКоннектора.Аутентификация = КоннекторHTTP.НоваяАутентификацияОС();
		Иначе
			ИмяПарольПользователя = Справочники.гкс_ПодключениеКВебСервисам.ИмяПарольПользователя(Выборка.Подключение);
			НастройкиКоннектора.Аутентификация = КоннекторHTTP.НоваяАутентификацияBasic(
				ИмяПарольПользователя.Пользователь, ИмяПарольПользователя.Пароль);	
		КонецЕсли;
				
		Если Выборка.ИспользоватьПрокси Тогда
			НастройкиКоннектора.Прокси = Новый ИнтернетПрокси; 		
			Протокол = ?(Выборка.ИспользоватьЗащищенноеСоединение, "https", "http");
			НастройкиКоннектора.Прокси.Установить(Протокол, Выборка.ПроксиСервер, Выборка.ПроксиПорт, , , Истина);
		КонецЕсли;
		
		// дополнительная информация
		НастройкиКоннектора.Вставить("Подключение", Выборка.Подключение);
		НастройкиКоннектора.Вставить("Логировать", Выборка.Логировать);
        НастройкиКоннектора.Вставить("Метод", Выборка.Метод);
		
	КонецЕсли;
		
	Возврат НастройкиКоннектора;
		
КонецФункции		   

Процедура Логировать(СобытиеЛога) Экспорт
	РегистрыСведений.гкс_ЛогСобытийВебСервисов.Логировать(СобытиеЛога);
КонецПроцедуры

// Обработчик регламентного задания гкс_ОчисткаЛогаВебСервисов.
Процедура ОчисткаЛогаВебСервисов() Экспорт                                          
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОчисткаЛогаВебСервисов;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	СрокХраненияЛога = СрокХраненияЛогаВебСервисов();
	
	Если СрокХраненияЛога = 0 Тогда
		Возврат;
	КонецЕсли;  
	
	ОчиститьЛогСервисов(СрокХраненияЛога);
		
КонецПроцедуры   

// Событие лога.
// 
// Параметры:
//  Ресурс - СправочникСсылка.гкс_РесурсыВебСервисов -
// 
// Возвращаемое значение:
//  Структура - Событие лога:
// * УниверсальнаяДата - Число -
// * Ресурс - СправочникСсылка.гкс_РесурсыВебСервисов -
// * ИмяМетода - Строка -
// * Идентификатор - Строка -
// * КодСостояния - Число - 
// * Длительность - Число - 
// * ХранилищеЗапроса - Неопределено - 
// * ХранилищеОтвета - Неопределено -  
// * ТипСодержимого - Строка - 
// * Дата - Дата -
Функция СобытиеЛога(Ресурс) Экспорт
	Возврат РегистрыСведений.гкс_ЛогСобытийВебСервисов.СобытиеЛога(Ресурс);
КонецФункции

// Метод сервиса.
// 
// Параметры:
//  Сервис - СправочникСсылка.гкс_РесурсыВебСервисов - 
// 
// Возвращаемое значение:
//  Строка - 
Функция МетодСервиса(Сервис) Экспорт
	Возврат Справочники.гкс_РесурсыВебСервисов.Метод(Сервис);	
КонецФункции

Функция ЗаголовкиСервисаКакСоотвествие(Сервис) Экспорт
	Возврат Справочники.гкс_РесурсыВебСервисов.ЗаголовкиКакСоотвествие(Сервис);	
КонецФункции

// Возвращает URL
// 
// Параметры:
//  Ресурс - СправочникСсылка.гкс_РесурсыВебСервисов - Сервис
//  ЗначенияПараметров - Структура - Значение параметров для заполнения
//
// Возвращаемое значение:
//  Строка - полный адрес ресурса, включая родительские адреса
//
Функция ПолныйАдресРесурса(Ресурс, ЗначенияПараметров = Неопределено) Экспорт
	
	Возврат Справочники.гкс_РесурсыВебСервисов.ПолныйАдрес(Ресурс, ЗначенияПараметров);
	
КонецФункции

Функция ПодключениеКСервису(Сервис) Экспорт
	Возврат Справочники.гкс_РесурсыВебСервисов.ПодключениеКСервису(Сервис);
КонецФункции

// Проверяет что переданная технология обмена является SOAP.
// 
// Параметры:
//  ТехнологияОбмена - ПеречислениеСсылка.гкс_ТехнологииОбменаДанными - проверяемая технология обмена.
// 
// Возвращаемое значение:
//  Булево - Истина, если технология обмена является SOAP
//
Функция ЭтоSOAP(ТехнологияОбмена) Экспорт
	Возврат ТехнологияОбмена = ПредопределенноеЗначение("Перечисление.гкс_ТехнологииОбменаДанными.SOAP");
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
//
// Определяет следующие свойств регламентных заданий:
//  - зависимость от функциональных опций.
//  - возможность выполнения в различных режимах работы программы.
//  - прочие параметры.
//
// Параметры:
//  Настройки - ТаблицаЗначений - таблица значений с колонками:
//    * РегламентноеЗадание - ОбъектМетаданныхРегламентноеЗадание - регламентное задание.
//    * ФункциональнаяОпция - ОбъектМетаданныхФункциональнаяОпция - функциональная опция,
//        от которой зависит регламентное задание.
//    * ЗависимостьПоИ      - Булево - если регламентное задание зависит более, чем
//        от одной функциональной опции и его необходимо включать только тогда,
//        когда все функциональные опции включены, то следует указывать Истина
//        для каждой зависимости.
//        По умолчанию Ложь - если хотя бы одна функциональная опция включена,
//        то регламентное задание тоже включено.
//    * ВключатьПриВключенииФункциональнойОпции - Булево, Неопределено - если Ложь, то при
//        включении функциональной опции регламентное задание не будет включаться. Значение
//        Неопределено соответствует значению Истина.
//        По умолчанию - неопределено.
//    * ДоступноВПодчиненномУзлеРИБ - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в РИБ.
//        По умолчанию - неопределено.
//    * ДоступноВПодчиненномУзлеКОД - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в подчиненном узле КОД.
//        По умолчанию - неопределено.
//    * ДоступноВАвтономномРабочемМесте - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в автономном рабочем месте.
//        По умолчанию - неопределено.
//    * ДоступноВМоделиСервиса      - Булево, Неопределено - Истина или Неопределено, если регламентное
//        задание доступно в модели сервиса.
//        По умолчанию - неопределено.
//    * РаботаетСВнешнимиРесурсами  - Булево - Истина, если регламентное задание модифицирует данные
//        во внешних источниках (получение почты, синхронизация данных и т.п.). Не следует устанавливать
//        значение Истина, для регламентных заданий, не модифицирующих данные во внешних источниках.
//        Например, регламентное задание ЗагрузкаКурсовВалют. По умолчанию - Ложь.
//    * Параметризуется             - Булево - Истина, если регламентное задание параметризованное.
//        По умолчанию - Ложь.
//
// Например:
//	Настройка = Настройки.Добавить();
//	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеСтатусовДоставкиSMS;
//	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
//	Настройка.ДоступноВМоделиСервиса = Ложь;
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.гкс_ОчисткаЛогаВебСервисов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь; 
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьЛогСервисов(СрокХраненияЛога)
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;  
	
	РегистрыСведений.гкс_ЛогСобытийВебСервисов.СократитьЗаписиЛога(СрокХраненияЛога);
	
КонецПроцедуры   

Функция СрокХраненияЛогаВебСервисов() 
	Возврат гкс_РаботаСВебСервисамиПовтИсп.СрокХраненияЛогаВебСервисов();
КонецФункции

#КонецОбласти
